package com.example.learntodrive.law;

public class Questions4 {

    private String Questions11[] = {
            "Согласно закону РА \"Об обеспечении безопасности дорожного движения\", удостоверение на право управления транспортных средств категории \"А\" может выдаться:",
            "Согласно закону РА \"Об обеспечении безопасности дорожного движения\", удостоверение на право управления транспортных средств категории \"BE\" может выдаться:",
            "Согласно закону РA \"Об обеспечении безопасности дорожного движения\", лицам, имеющим водительское удостоверение на управление транспортных средств категорий \"B\", \"C\" и \"D\", разрешается их водить также с прицепами, если разрешенная максимальная масса прицепа:",
            "Согласно закону РА \"Об обеспечении безопасности дорожного движения\", недостаточной видимостью считается:",
            "Согласно закону РА \"Об обеспечении безопасности дорожного движения\", к пешеходами приравниваются: ",
            "Согласно закону РА \"Об обеспечении безопасности дорожного движения\", в каком сроке со дня приобретения транспортного средства оно должно быть представленно на государсвенную регистрацию в органы Дорожной полиции?",
            "Согласно закону РА \"Об обеспечении безопасности дорожного движения\", до начала движения водитель обязан проверить:",
            "Согласно закону РА \"Об обеспечении безопасности дорожного движения\", водитель траспортного средства обязан предоставлять транспортное средство в целях содействия:",
            "Согласно закону РА \"Об обеспечении безопасности дорожного движения\", водитель механического траспортного средства обязан иметь при себе:",
            "Согласно закону РА \"Об обеспечении безопасности дорожного движения\", регулировщиком считается:"
    };
    private String Questions12[] = {
            "Согласно закону РА \"Об обеспечении безопасности дорожного движения\", разрешенной максимальной массой считается:",
            "Согласно закону РА \"Об обеспечении безопасности дорожного движения\", велосипедом считаестя:",
            "Согласно закону РА \"Об обеспечении безопасности дорожного движения\", обучающий вождению транспортного средства:",
            "Согласно закону РА \"Об обеспечении безопасности дорожного движения\", аварийной ситуацией считается:",
            "Согласно закону РА \"Об обеспечении безопасности дорожного движения\", автобусом считается:",
            "Согласно закону РА \"Об обеспечении безопасности дорожного движения\", легковым автомобилем считается:",
            "Согласно закону РА \"Об обеспечении безопасности дорожного движения\", пассажиром считается: ",
            "Согласно закону РА \"Об обеспечении безопасности дорожного движения\", проезжей частью дороги считается: ",
            "Согласно закону РА \"Об обеспечении безопасности дорожного движения\", пешеходом считается:",
            "Согласно закону РА \"Об обеспечении безопасности дорожного движения\", считается ли перекрестком выезд с прилегающей территории на дорогу?"
    };
    private String Questions13[] = {
            "Согласно закону РА \"Об обеспечении безопасности дорожного движения\", тротуаром считается:",
            "Перестроением считается:",
            "Уступить дорогу другим транспортным средствам означает:",
            "Согласно закону РА \"Об обеспечении безопасности дорожного движения\", разрешенной максимальной массой считается:",
            "Согласно закону РА \"Об обеспечении безопасности дорожного движения\", транспортным средством общего пользования считается:",
            "Согласно закону РА \"Об обеспечении безопасности дорожного движения\", остановкой считается:",
            "Согласно закону РА \"Об обеспечении безопасности дорожного движения\", международное удостоверение на право управления транспортных средств категории \"C\" может выдаться:",
            "Согласно закону РА \"Об обеспечении безопасности дорожного движения\", удостоверение на право управления транспортных средств категории \"А\" может выдаться:",
            "Согласно закону РА \"Об обеспечении безопасности дорожного движения\", темным временем суток считается:",
            "Согласно закону РА \"Об обеспечении безопасности дорожного движения\", начальное обучение по практическому вождению транспортного средства осуществляется:"
    };
    private String Questions14[] = {
            "Должен ли обучающийся вождению во время учебной езды пристегиваться ремнями безопасности?",
            "Согласно закону РА \"Об обеспечении безопасности дорожного движения\", водительское удостоверение на право управления транспортных средств категории \"D\" и подкатегории \"D1\" может выдаться:",
            "Согласно закону РА \"Об обеспечении безопасности дорожного движения\", лицам, призванным на службу в Вооруженные Силы и другие войска РА, водительское удостоверение на право управления транспортных средств категории \"D\" и подкатегории \"D1\" может выдаться:",
            "Согласно закону РА \"Об обеспечении безопасности дорожного движения\", ответственность за содержание в технически годном состоянии транспортного средства, участвующего в дорожном движении, несет:",
            "Согласно закону РА \"Об обеспечении безопасности дорожного движения\", водитель траспортного средства, в случае причастности к дорожно-транспортному происшествию, обязан:",
            "Согласно закону РА \"Об обеспечении безопасности дорожного движения\", национальные водительские удостоверения выдаются:",
            "Согласно закону РА \"Об обеспечении безопасности дорожного движения\", международные водительские удостоверения выдаются:",
            "Согласно закону РА \"Об обеспечении безопасности дорожного движения\", водительское удостоверение на управление транспортных средств категории \"D\" и подкатегории \"D1\" может выдаться тем лицам, которые имеют:",
            "Согласно закону РА \"Об обеспечении безопасности дорожного движения\", международное водительское удостоверение на управление транспортных средств категорий \"D\", \"DE\", подкатегорий \"D1\" и \"D1E\" может выдаться:",
            "Какой из указанных недвижимых объектов не является препятствием?\n"
    };

    private String Choice11[][] = {
            {"Лицам от 16 лет. ","Лицам от 17 лет.","Лицам от 18 лет. "},
            {"Лицам от 17 лет.","Лицам от 18 лет. ","Лицам от 19 лет."},
            {"750 килограмм. ","800 килограмм. ","1000 килограмм. "},
            {"Расстояние видимости дороги в темное время суток. ","Расстояние видимости дороги в населенных пунктах, в условиях отсутствия искусственного освещения проезжей части.","Видимость дороги и (или) расстояние видимости до 300 метров, в условиях тумана, дождя, снегопада и (или) в других неблагоприятных погодных условиях для обеспечения безопасности дорожного движения. "},
            {"Инвалиды, передвигающиеся в инвалидной коляске без двигателя. ","Лица, везущие (толкающие) тележку, санки, детскую или инвалидную коляску.","Все перечисленные лица. "},
            {"В течение 10 дней. ","В течение 15 дней. ","В течение 20 дней. "},
            {"Исправность тормозной системы и рулевого управления. ","Соответствие остаточной высоты рисунка протектора шин установленным нормам. ","Все перечисленное."},
            {"Служащим Полиции для перемещения в медицинское учреждение лиц, нуждающихся в срочной медицинской помощи,","Медицинским работникам, которые в целях оказания медицинской помощи следуют в том же направлении (с согласия водителя).","В обоих случаях."},
            {"Удостоверение на право управления транспортным средством данной категории и регистрационные документы транспортного средства.","Доверенность, в случае управления транспортного средства, принадлежащего другому лицу. ","Все перечисленные документы. "},
            {"Лицо, имеющее полномочия на регулирование дорожного движения и осуществляющее это регулирование в установленном законодательством порядке.","Любой участник дорожного движения (водитель, пассажир или пешеход), который выполняет регулирующие действия в случае необходимости. ","Все перечисленные лица."}
    };
    private String Choice12[][] = {
            {"Масса снаряженного и заправленного транспортного средства. ","Масса нагруженного, снаряженного и заправленного транспортного средства с водителем, пассажирами и грузом. "},
            {"Транспортное средство, в том числе инвалидная коляска, имеющее по меньшей мере 2 колеса и, как правило, приводимое в движение мускульной силой находящегося на нем человека, в частности, при помощи педалей или ручек. ","Транспортное средство, за исключением инвалидной коляски, имеющее по меньшей мере 2 колеса и, как правило, приводимое в движение мускульной силой находящегося на нем человека, в частности, при помощи педалей или ручек. "},
            {"Приравнивается к водителю. ","Не приравнивается к водителю. "},
            {"ситуация, возникшая вследствие действия и (или) бездействия участника движения, при которой создается реальная угроза дорожно-транспортного происшествия. ","ситуация, возникшая вследствие действия и (или) бездействия участника движения и (или) регулировщика, при которой создается реальная угроза дорожно транспортного происшествия."},
            {"Автомобиль, своей структурой и обустроенностью предназначенный для безопасной и удобной перевозки пассажиров и груза, имеющий более 8-и мест для сидения пассажиров. ","Автомобиль, своей структурой и обустроенностью предназначенный для безопасной и удобной перевозки пассажиров и груза, имеющий 8 и более мест для сидения пассажиров. "},
            {"Автомобиль, своей структурой и обустроенностью предназначенный для безопасной и удобной перевозки пассажиров и груза, имеющий не более 8-и мест для сидения пассажиров. ","Автомобиль, своей структурой и обустроенностью предназначенный для безопасной и удобной перевозки пассажиров и груза, имеющий не более 4-х мест для сидения пассажиров (за исключением детей до 12 лет). "},
            {"Лицо, находящееся в салоне (кабине) транспортного средства или на транспортном средстве, кроме водителя и обучающего вождению лица.","Лицо, находящееся в салоне (кабине) транспортного средства или на транспортном средстве, а также лицо, которое садится (поднимается) в транспортное средство и выходит из (сходит с) него, кроме водителя и обучающего вождению лица."},
            {"Элемент дороги, предназначенный для движения транспортных средств: ","Элемент дороги, предназначенный для движения безрельсовых транспортных средств: "},
            {"Лицо, находящееся вне транспортного средства на дороге, за исключением лица, имеющего полномочие на произведение работ на дороге и в порядке, установленном законодательством, осуществляющего данные работы. ","Лицо, находящееся вне транспортного средства на дороге, в том числе лица, имеющего полномочие на произведение работ на дороге и в порядке, установленном законодательством, осуществляющего данные работы."},
            {"Не считается. ","Считается. "}
    };
    private String Choice13[][] = {
            {"элемент дороги, примыкающий к проезжей части, предназначенный для движения пешехода в установленном законодательством порядке. ","элемент дороги, каким-либо образом отделенный от проезжей части, предназначенный для движения пешехода в установленном законодательством порядке. ","Оба указанных случая."},
            {"Выезд транспортного средства из занимаемого ряда обозначенной разметкой полосы движения, с сохранением первоначального направления движения.","Выезд транспортного средства из занимаемой полосы движения, с сохранением первоначального направления движения. ","Оба указанных случая."},
            {"Водитель не должен продолжать или возобновлять движение или осуществлять какой-либо маневр, если это может вынудить водителей других транспортных средств изменить направление движения или скорость. ","Водитель не должен продолжать или возобновлять движение или осуществлять какой-либо маневр, если это может вынудить водителей других транспортных средств внезапно изменить направление движения или скорость. ","Безоговорочно остановить транспортное средство."},
            {"Максимальная масса снаряженного и заправленного транспортного средства. ","Масса нагруженного, снаряженного и заправленного транспортного средства с водителем, пассажирами и грузом, которую предприятие-изготовитель установило в качестве максимально допустимой.","Масса нагруженноготранспортного средства с водителем, пассажирами и грузом, которую предприятие-изготовитель установило в качестве максимально допустимой. "},
            {"Транспортное средство (трамвай, тролейбус, автобус), имеющее места остановки (остановки), движущееся по маршрутам, перевозящее пассажиров и (или) багажи. ","Транспортное средство (трамвай, тролейбус, автобус), имеющее места остановки (остановки), движущееся по маршрутам, перевозящее пассажиров и (или) багажи, а также легковой автомобиль такси. ","Транспортное средство, движущееся по туристическому маршруту, перевозящее пассажиров и (или) багажи. "},
            {"Приведение транспортного средства в неподвижное состояние в связи с требованием пассажира. ","Приведение транспортного средства в преднамеренное неподвижное состояние на время более 5 минут, если это не связано с посадкой, высадкой пассажиров или загрузкой, разгрузкой транспортного средства.","Приведение транспортного средства в преднамеренное неподвижное состояние на время до 5 минут или на время, необходимое для посадки или высадки пассажира и (или) загрузки, разгрузки транспортного средства. "},
            {"Лицам от 21 лет.","Лицам от 20 лет.","Лицам от 18 лет."},
            {"Лицам от 16 лет. ","Лицам от 17 лет.","Лицам от 18 лет. "},
            {"Период времени между концом вечерних сумерек и началом утренних сумерек.","Период времени осенью и зимой - с 20.00 вечера до 8.оо утра, весной и летом - с 22.00 вечера до 6.00 утра. ","Время отсутствия солнечного освещения"},
            {"На закрытой площадке или автодроме. ","Вне населённых пунктов, на дорогах, учитывая интенсивность движения транспортных средств.","На любой дороге (кроме автомагистралей), учитывая интенсивность движения транспортных средств."}
    };
    private String Choice14[][] = {
            {"Должен.","Не должен. ","Не должен, если это затрудняет управление автомобиля.","Не должен, если обучающий разрешает вести. "},
            {"Лицам от 18 лет.","Лицам от 19 лет.","Лицам от 20 лет.","Лицам от 21 года. "},
            {"Лицам от 18 лет.","Лицам от 19 лет.","Лицам от 20 лет.","Лицам от 21 года. "},
            {"Собственник или пользователь транспортного средства. ","Организация, которая продала транспортное средство.","Организация, которая провела последний годовой технический осмотр транспортного средства. ","Все перечисленные лица и организации."},
            {"Немедленно остановить транспортное средство.","Включить аварийную световую сигнализацию.","Не перемещать связанные с аварией предметы.","Выполнить все перечисленные действия."},
            {"На 5 лет. ","На 10 лет. ","На 20 лет.","Бессрочно. "},
            {"На 1 год.","На 3 года. ","На 5 лет. ","Бессрочно."},
            {"Удостоверение на управление транспортных средств категории \"B\" или \"C\" или подкатегории \"C1\" и им исполнился 21 год. ","Удостоверение на управление транспортных средств категории \"B\" или \"C\" или подкатегории \"B1\" и им исполнилось 18 лет. ","Удостоверение на управление транспортных средств категорий \"AB\" или подкатегорий \"A1B1\" и им исполнилось 18 лет. ","Удостоверение на управление транспортных средств категории \"B\" или \"C\" или подкатегории \"C1\" и им исполнилось 20 лет. "},
            {"Лицам от 19 лет.","Лицам от 20 лет.","Лицам от 21 года. ","Лицам от 22 лет."},
            {"Повреждение покрытия проезжей части","Посторонний предмет ","Неисправный или неподвижный автомобиль","Автомобиль, остановившийся из-за пробки "}
    };


    private String CoorectAnswers11 [] = {
            "Лицам от 18 лет. ",
            "Лицам от 19 лет.",
            "750 килограмм. ",
            "Видимость дороги и (или) расстояние видимости до 300 метров, в условиях тумана, дождя, снегопада и (или) в других неблагоприятных погодных условиях для обеспечения безопасности дорожного движения. ",
            "Все перечисленные лица. ",
            "В течение 15 дней. ",
            "Все перечисленное.",
            "В обоих случаях.",
            "Удостоверение на право управления транспортным средством данной категории и регистрационные документы транспортного средства.",
            "Лицо, имеющее полномочия на регулирование дорожного движения и осуществляющее это регулирование в установленном законодательством порядке."
    };
    private String CoorectAnswers12[] = {
            "Масса нагруженного, снаряженного и заправленного транспортного средства с водителем, пассажирами и грузом. ",
            "Транспортное средство, за исключением инвалидной коляски, имеющее по меньшей мере 2 колеса и, как правило, приводимое в движение мускульной силой находящегося на нем человека, в частности, при помощи педалей или ручек. ",
            "Приравнивается к водителю. ",
            "ситуация, возникшая вследствие действия и (или) бездействия участника движения и (или) регулировщика, при которой создается реальная угроза дорожно транспортного происшествия.",
            "Автомобиль, своей структурой и обустроенностью предназначенный для безопасной и удобной перевозки пассажиров и груза, имеющий более 8-и мест для сидения пассажиров. ",
            "Автомобиль, своей структурой и обустроенностью предназначенный для безопасной и удобной перевозки пассажиров и груза, имеющий не более 8-и мест для сидения пассажиров. ",
            "Лицо, находящееся в салоне (кабине) транспортного средства или на транспортном средстве, а также лицо, которое садится (поднимается) в транспортное средство и выходит из (сходит с) него, кроме водителя и обучающего вождению лица.",
            "Элемент дороги, предназначенный для движения безрельсовых транспортных средств: ",
            "Лицо, находящееся вне транспортного средства на дороге, за исключением лица, имеющего полномочие на произведение работ на дороге и в порядке, установленном законодательством, осуществляющего данные работы. ",
            "Не считается. "
    };
    private String CoorectAnswers13[] = {
            "Оба указанных случая.",
            "Оба указанных случая.",
            "Водитель не должен продолжать или возобновлять движение или осуществлять какой-либо маневр, если это может вынудить водителей других транспортных средств внезапно изменить направление движения или скорость. ",
            "Масса нагруженного, снаряженного и заправленного транспортного средства с водителем, пассажирами и грузом, которую предприятие-изготовитель установило в качестве максимально допустимой.",
            "Транспортное средство (трамвай, тролейбус, автобус), имеющее места остановки (остановки), движущееся по маршрутам, перевозящее пассажиров и (или) багажи. ",
            "Приведение транспортного средства в преднамеренное неподвижное состояние на время до 5 минут или на время, необходимое для посадки или высадки пассажира и (или) загрузки, разгрузки транспортного средства. ",
            "Лицам от 21 лет.",
            "Лицам от 18 лет.",
            "Период времени между концом вечерних сумерек и началом утренних сумерек.",
            "На закрытой площадке или автодроме. "
    };
    private String CoorectAnswers14 [] = {
            "Должен.",
            "Лицам от 21 года. ",
            "Лицам от 19 лет.",
            "Собственник или пользователь транспортного средства. ",
            "Выполнить все перечисленные действия.",
            "На 10 лет. ",
            "На 3 года. ",
            "Удостоверение на управление транспортных средств категории \"B\" или \"C\" или подкатегории \"C1\" и им исполнился 21 год. ",
            "Лицам от 21 года. ",
            "Автомобиль, остановившийся из-за пробки "
    };

    private String QuestionsType11[] = {
            "radiobutton",
            "radiobutton",
            "radiobutton",
            "radiobutton",
            "radiobutton",
            "radiobutton",
            "radiobutton",
            "radiobutton",
            "radiobutton",
            "radiobutton"
    };
    private String QuestionsType12[] = {
            "radiobutton",
            "radiobutton",
            "radiobutton",
            "radiobutton",
            "radiobutton",
            "radiobutton",
            "radiobutton",
            "radiobutton",
            "radiobutton",
            "radiobutton"
    };
    private String QuestionsType13[] = {
            "radiobutton",
            "radiobutton",
            "radiobutton",
            "radiobutton",
            "radiobutton",
            "radiobutton",
            "radiobutton",
            "radiobutton",
            "radiobutton",
            "radiobutton"
    };
    private String QuestionsType14[] = {
            "radiobutton",
            "radiobutton",
            "radiobutton",
            "radiobutton",
            "radiobutton",
            "radiobutton",
            "radiobutton",
            "radiobutton",
            "radiobutton",
            "radiobutton"
    };


    public String getQuestions11(int q) {
        String questions11 = Questions11[q];
        return questions11;
    }
    public String getQuestions12(int w){
        String questions12 = Questions12[w];
        return questions12;
    }
    public String getQuestions13(int a){
        String questions13 = Questions13[a];
        return questions13;
    }
    public String getQuestions14(int s){
        String questions14 = Questions14[s];
        return questions14;
    }


    public String[] getChoice11(int q) {
        String[] choice11 = Choice11[q];
        return choice11;
    }
    public String[] getChoice12(int w){
        String[] choice12 = Choice12[w];
        return choice12;
    }
    public String[] getChoice13(int a){
        String[] choice13 = Choice13[a];
        return choice13;
    }
    public String[] getChoice14(int s){
        String[] choice14 = Choice14[s];
        return choice14;
    }


    public String getType11(int q) {
        String type11 = QuestionsType11[q];
        return type11;
    }
    public String getType12(int w){
        String type12 = QuestionsType12[w];
        return type12;
    }
    public String getType13(int a){
        String type13 = QuestionsType13[a];
        return type13;
    }
    public String getType14(int s) {
        String type14 = QuestionsType14[s];
        return type14;
    }


    public int getLenght11(){
        return Questions11.length;
    }
    public int getLenght12(){
        return Questions12.length;
    }
    public int getLenght13(){
        return Questions13.length;
    }
    public int getLenght14(){
        return Questions14.length;
    }


    public String getCoorectAnswers11(int q) {

        String correct11 = CoorectAnswers11[q];

        return correct11;
    }
    public String getCoorectAnswers12(int w){

        String coorect12 = CoorectAnswers12[w];

        return coorect12;
    }
    public String getCoorectAnswers13(int a){

        String coorect13 = CoorectAnswers13[a];

        return coorect13;
    }
    public String getCoorectAnswers14(int s){

        String coorect14 = CoorectAnswers14[s];

        return coorect14;
    }
}
