package com.example.learntodrive.law;

public class Questions4 {

    private String Questions11[] = {
            "Согласно закону РА \"Об обеспечении безопасности дорожного движения\", удостоверение на право управления транспортных средств категории \"А\" может выдаться:",
            "Согласно закону РА \"Об обеспечении безопасности дорожного движения\", удостоверение на право управления транспортных средств категории \"BE\" может выдаться:",
            "Согласно закону РО \"Об обеспечении безопасности дорожного движения\", лицам, имеющим водительское удостоверение на управление транспортных средств категорий \"B\", \"C\" и \"D\", разрешается их водить также с прицепами, если разрешенная максимальная масса прицепа:",
            "Согласно закону РА \"Об обеспечении безопасности дорожного движения\", недостаточной видимостью считается:",
            "Согласно закону РА \"Об обеспечении безопасности дорожного движения\", к пешеходами приравниваются: ",
            "Согласно закону РА \"Об обеспечении безопасности дорожного движения\", в каком сроке со дня приобретения транспортного средства оно должно быть представленно на государсвенную регистрацию в органы Дорожной полиции?",
            "Согласно закону РА \"Об обеспечении безопасности дорожного движения\", до начала движения водитель обязан проверить:",
            "Согласно закону РА \"Об обеспечении безопасности дорожного движения\", водитель траспортного средства обязан предоставлять транспортное средство в целях содействия:",
            "Согласно закону РА \"Об обеспечении безопасности дорожного движения\", водитель механического траспортного средства обязан иметь при себе:",
            "Согласно закону РА \"Об обеспечении безопасности дорожного движения\", регулировщиком считается:"
    };
    private String Questions12[] = {
            "Согласно закону РА \"Об обеспечении безопасности дорожного движения\", разрешенной максимальной массой считается:",
            "Согласно закону РА \"Об обеспечении безопасности дорожного движения\", велосипедом считаестя:",
            "Согласно закону РА \"Об обеспечении безопасности дорожного движения\", обучающий вождению транспортного средства:",
            "Согласно закону РА \"Об обеспечении безопасности дорожного движения\", аварийной ситуацией считается:",
            "Согласно закону РА \"Об обеспечении безопасности дорожного движения\", автобусом считается:",
            "Согласно закону РА \"Об обеспечении безопасности дорожного движения\", легковым автомобилем считается:",
            "",
            "",
            "",
            ""
    };
    private String Questions13[] = {
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
    };
    private String Questions14[] = {
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
    };

    private String Choice11[][] = {
            {"Лицам от 16 лет. ","Лицам от 17 лет.","Лицам от 18 лет. "},
            {"Лицам от 17 лет.","Лицам от 18 лет. ","Лицам от 19 лет."},
            {"750 килограмм. ","800 килограмм. ","1000 килограмм. "},
            {"Расстояние видимости дороги в темное время суток. ","Расстояние видимости дороги в населенных пунктах, в условиях отсутствия искусственного освещения проезжей части.","Видимость дороги и (или) расстояние видимости до 300 метров, в условиях тумана, дождя, снегопада и (или) в других неблагоприятных погодных условиях для обеспечения безопасности дорожного движения. "},
            {"Инвалиды, передвигающиеся в инвалидной коляске без двигателя. ","Лица, везущие (толкающие) тележку, санки, детскую или инвалидную коляску.","Все перечисленные лица. "},
            {"В течение 10 дней. ","В течение 15 дней. ","В течение 20 дней. "},
            {"Исправность тормозной системы и рулевого управления. ","Соответствие остаточной высоты рисунка протектора шин установленным нормам. ","Все перечисленное."},
            {"Служащим Полиции для перемещения в медицинское учреждение лиц, нуждающихся в срочной медицинской помощи,","Медицинским работникам, которые в целях оказания медицинской помощи следуют в том же направлении (с согласия водителя).","В обоих случаях."},
            {"Удостоверение на право управления транспортным средством данной категории и регистрационные документы транспортного средства.","Доверенность, в случае управления транспортного средства, принадлежащего другому лицу. ","Все перечисленные документы. "},
            {"Лицо, имеющее полномочия на регулирование дорожного движения и осуществляющее это регулирование в установленном законодательством порядке.","Любой участник дорожного движения (водитель, пассажир или пешеход), который выполняет регулирующие действия в случае необходимости. ","Все перечисленные лица."}
    };
    private String Choice12[][] = {
            {"Масса снаряженного и заправленного транспортного средства. ","Масса нагруженного, снаряженного и заправленного транспортного средства с водителем, пассажирами и грузом. "},
            {"Транспортное средство, в том числе инвалидная коляска, имеющее по меньшей мере 2 колеса и, как правило, приводимое в движение мускульной силой находящегося на нем человека, в частности, при помощи педалей или ручек. ","Транспортное средство, за исключением инвалидной коляски, имеющее по меньшей мере 2 колеса и, как правило, приводимое в движение мускульной силой находящегося на нем человека, в частности, при помощи педалей или ручек. "},
            {"Приравнивается к водителю. ","Не приравнивается к водителю. "},
            {"ситуация, возникшая вследствие действия и (или) бездействия участника движения, при которой создается реальная угроза дорожно-транспортного происшествия. ","ситуация, возникшая вследствие действия и (или) бездействия участника движения и (или) регулировщика, при которой создается реальная угроза дорожно транспортного происшествия."},
            {"Автомобиль, своей структурой и обустроенностью предназначенный для безопасной и удобной перевозки пассажиров и груза, имеющий более 8-и мест для сидения пассажиров. ","Автомобиль, своей структурой и обустроенностью предназначенный для безопасной и удобной перевозки пассажиров и груза, имеющий 8 и более мест для сидения пассажиров. "},
            {"Автомобиль, своей структурой и обустроенностью предназначенный для безопасной и удобной перевозки пассажиров и груза, имеющий не более 8-и мест для сидения пассажиров. ","Автомобиль, своей структурой и обустроенностью предназначенный для безопасной и удобной перевозки пассажиров и груза, имеющий не более 4-х мест для сидения пассажиров (за исключением детей до 12 лет). "},
            {"",""},
            {"",""},
            {"",""},
            {"",""}
    };
    private String Choice13[][] = {
            {"","",""},
            {"","",""},
            {"","",""},
            {"","",""},
            {"","",""},
            {"","",""},
            {"","",""},
            {"","",""},
            {"","",""},
            {"","",""}
    };
    private String Choice14[][] = {
            {"","","",""},
            {"","","",""},
            {"","","",""},
            {"","","",""},
            {"","","",""},
            {"","","",""},
            {"","","",""},
            {"","","",""},
            {"","","",""},
            {"","","",""}
    };


    private String CoorectAnswers11 [] = {
            "Лицам от 18 лет. ",
            "Лицам от 19 лет.",
            "750 килограмм. ",
            "Видимость дороги и (или) расстояние видимости до 300 метров, в условиях тумана, дождя, снегопада и (или) в других неблагоприятных погодных условиях для обеспечения безопасности дорожного движения. ",
            "Все перечисленные лица. ",
            "В течение 15 дней. ",
            "Все перечисленное.",
            "В обоих случаях.",
            "Удостоверение на право управления транспортным средством данной категории и регистрационные документы транспортного средства.",
            "Лицо, имеющее полномочия на регулирование дорожного движения и осуществляющее это регулирование в установленном законодательством порядке."
    };
    private String CoorectAnswers12[] = {
            "Масса нагруженного, снаряженного и заправленного транспортного средства с водителем, пассажирами и грузом. ",
            "Транспортное средство, за исключением инвалидной коляски, имеющее по меньшей мере 2 колеса и, как правило, приводимое в движение мускульной силой находящегося на нем человека, в частности, при помощи педалей или ручек. ",
            "Приравнивается к водителю. ",
            "ситуация, возникшая вследствие действия и (или) бездействия участника движения и (или) регулировщика, при которой создается реальная угроза дорожно транспортного происшествия.",
            "Автомобиль, своей структурой и обустроенностью предназначенный для безопасной и удобной перевозки пассажиров и груза, имеющий более 8-и мест для сидения пассажиров. ",
            "Автомобиль, своей структурой и обустроенностью предназначенный для безопасной и удобной перевозки пассажиров и груза, имеющий не более 8-и мест для сидения пассажиров. ",
            "",
            "",
            "",
            ""
    };
    private String CoorectAnswers13[] = {
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
    };
    private String CoorectAnswers14 [] = {
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
    };

    private String QuestionsType11[] = {
            "radiobutton",
            "radiobutton",
            "radiobutton",
            "radiobutton",
            "radiobutton",
            "radiobutton",
            "radiobutton",
            "radiobutton",
            "radiobutton",
            "radiobutton"
    };
    private String QuestionsType12[] = {
            "radiobutton",
            "radiobutton",
            "radiobutton",
            "radiobutton",
            "radiobutton",
            "radiobutton",
            "radiobutton",
            "radiobutton",
            "radiobutton",
            "radiobutton"
    };
    private String QuestionsType13[] = {
            "radiobutton",
            "radiobutton",
            "radiobutton",
            "radiobutton",
            "radiobutton",
            "radiobutton",
            "radiobutton",
            "radiobutton",
            "radiobutton",
            "radiobutton"
    };
    private String QuestionsType14[] = {
            "radiobutton",
            "radiobutton",
            "radiobutton",
            "radiobutton",
            "radiobutton",
            "radiobutton",
            "radiobutton",
            "radiobutton",
            "radiobutton",
            "radiobutton"
    };


    public String getQuestions11(int q) {
        String questions11 = Questions11[q];
        return questions11;
    }
    public String getQuestions12(int w){
        String questions12 = Questions12[w];
        return questions12;
    }
    public String getQuestions13(int a){
        String questions13 = Questions13[a];
        return questions13;
    }
    public String getQuestions14(int s){
        String questions14 = Questions14[s];
        return questions14;
    }


    public String[] getChoice11(int q) {
        String[] choice11 = Choice11[q];
        return choice11;
    }
    public String[] getChoice12(int w){
        String[] choice12 = Choice12[w];
        return choice12;
    }
    public String[] getChoice13(int a){
        String[] choice13 = Choice13[a];
        return choice13;
    }
    public String[] getChoice14(int s){
        String[] choice14 = Choice14[s];
        return choice14;
    }


    public String getType11(int q) {
        String type11 = QuestionsType11[q];
        return type11;
    }
    public String getType12(int w){
        String type12 = QuestionsType12[w];
        return type12;
    }
    public String getType13(int a){
        String type13 = QuestionsType13[a];
        return type13;
    }
    public String getType14(int s) {
        String type14 = QuestionsType14[s];
        return type14;
    }


    public int getLenght11(){
        return Questions11.length;
    }
    public int getLenght12(){
        return Questions12.length;
    }
    public int getLenght13(){
        return Questions13.length;
    }
    public int getLenght14(){
        return Questions14.length;
    }


    public String getCoorectAnswers11(int q) {

        String correct11 = CoorectAnswers11[q];

        return correct11;
    }
    public String getCoorectAnswers12(int w){

        String coorect12 = CoorectAnswers12[w];

        return coorect12;
    }
    public String getCoorectAnswers13(int a){

        String coorect13 = CoorectAnswers13[a];

        return coorect13;
    }
    public String getCoorectAnswers14(int s){

        String coorect14 = CoorectAnswers14[s];

        return coorect14;
    }
}
